### PANDAS
Python with Pandas is used in a wide range of fields including academic and commercial domains including finance, economics, analytics,etc.

###### KEY FEATURES

1. Fast and efficient DataFrame object with default and coustomized indexing.
2. Tools for loading into in-memory

In [1]:
# Pandas is a popular package for data science  it offers powerful expressive and flexible data structure that make
# data manipulation and analysis easy among many other things. 
# The DataFrame is one of these structures.Each row of these grids corresponds

In [10]:
#create dataframe from dict/list

import pandas as pd
data = {'Name':['Tom','Jack','Steve','Ricky'], 'Age': [28,34,29,42]}
df = pd.DataFrame(data)
#By Default the index for rows is 0,1,2......
print(df)

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [65]:
#df = pd.DataFrame(data,index =['rank1','rank2','rank3','rank4'])
#print(df)

In [10]:
#add coumn salary
df['Salary'] = pd.Series([2300,4000,3000,6000])
print(df)

    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    3000
3  Ricky   42    6000

In [11]:
#add row
df = df.append({'Name' : 'Bob','Age': 34 ,'Salary' : 2100 },ignore_index = True)
print(df)

    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    3000
3  Ricky   42    6000
4    Bob   34    2100

In [3]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
Name    4 non-null object
Age     4 non-null int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes
None

In [5]:
print("Below is desire")
print(df.describe) #describe about each column in data frame

Below is desire
<bound method NDFrame.describe of     Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42>

In [6]:
print(df.loc[2])  #select rows baised on integer index 0,1,2

Name    Steve
Age        29
Name: 2, dtype: object

In [11]:
df.Loc['3'] #select rows with index lablel
print(df['Age']) #select column Age

AttributeError: 'DataFrame' object has no attribute 'Loc'

In [52]:
#df[2:4]
#print("Describe Age",df['Age'].describe())

In [53]:
#print("Sum of Age",df['Age'].sum())

In [88]:
#delete.column
#del df['Salary'] #using del function
#print(df)

In [94]:
#df.pop('Age') #using pop function
#df = df.drop(1) #drop the row index 1
#df = df.drop(column =['Age','Salary'])
#print(df)

    Name  Salary
0    Tom    2300
1   Jack    4000
2  Steve    3000
3  Ricky    6000
4    Bob    2100

In [106]:
#df = df.drop(1) #drop the row index 1
#df = df.drop(column =['Age','Salary'])
#print(df)

In [109]:
#df = df.drop(column =['Age','Salary'])
#print(df)

TypeError: drop() got an unexpected keyword argument 'column'

In [12]:
#Reshaping the data
print(df)

    Name  Age  Salary
0    Tom   28    2300
1   Jack   34    4000
2  Steve   29    3000
3  Ricky   42    6000
4    Bob   34    2100

In [13]:
print(pd.melt(df))

   variable  value
0      Name    Tom
1      Name   Jack
2      Name  Steve
3      Name  Ricky
4      Name    Bob
5       Age     28
6       Age     34
7       Age     29
8       Age     42
9       Age     34
10   Salary   2300
11   Salary   4000
12   Salary   3000
13   Salary   6000
14   Salary   2100

In [14]:
print(df.sort_values('Age', ascending = False))

    Name  Age  Salary
3  Ricky   42    6000
1   Jack   34    4000
4    Bob   34    2100
2  Steve   29    3000
0    Tom   28    2300

In [16]:
print(df.sort_values('Age', ascending = True))

    Name  Age  Salary
0    Tom   28    2300
2  Steve   29    3000
1   Jack   34    4000
4    Bob   34    2100
3  Ricky   42    6000

In [15]:
print(df.rename(columns ={'Salary':'Sal'}))

    Name  Age   Sal
0    Tom   28  2300
1   Jack   34  4000
2  Steve   29  3000
3  Ricky   42  6000
4    Bob   34  2100

In [29]:
#Creating data frame from combining lists
#The intial set of baby names and births

import pandas as pd
names = ['Pikachu','Charmender','Bulbasor','Squartel','Piege']
births = [968,155,77,578,973]

#create data tuples
data_tuples = list(zip(names,births))

#create data frame from tuples
df = pd.DataFrame(data = data_tuples, columns =['Names','Births'])
print(df)

        Names  Births
0     Pikachu     968
1  Charmender     155
2    Bulbasor      77
3    Squartel     578
4       Piege     973

In [28]:
print(df)

        Names  Births
0     Pikachu     968
1  Charmender     155
2    Bulbasor      77
3    Squartel     578
4       Piege     973

In [30]:
print('Sum of Birth Column :', df['Births'].sum()) #sums of rows

Sum of Birth Column : 2751

In [32]:
print('Mean of Column Births :', df['Births'].mean()) #Mean of rows

Mean of Column Births : 550.2

In [35]:
#write df to csv with header
df.to_csv('E:\\Python\\births1880.csv',index = False, header = True )

In [37]:
#write df to csv with header
df.to_csv('E:\\Python\\births1881.csv',index = False, header = False )

In [38]:
#write df to csv with header
df.to_csv('E:\\Python\\births1882.csv',index = False, header = True )

In [39]:
#write df to csv with header
df.to_csv('E:\\Python\\births1883.csv',index = True, header = True )

In [40]:
#write df to csv with header
df.to_csv('E:\\Python\\births1884.csv',index = True, header = False )

In [22]:
#WARNING change the file before reading
#read csv file
#Location = r'E:\\Python\\births1882.csv'
df1 = pd.read_csv('E:\\Python\\births1882.csv')
print(df1)

        Names  Births
0     Pikachu   968.0
1  Charmender   155.0
2    Bulbasor    77.0
3    Squartel   578.0
4       Piege   973.0
5        Alex     NaN
6         NaN   330.0

In [23]:
Location = r'E:\\Python\\births1882.csv'
df1 = pd.read_csv(Location)
print(df1)

        Names  Births
0     Pikachu   968.0
1  Charmender   155.0
2    Bulbasor    77.0
3    Squartel   578.0
4       Piege   973.0
5        Alex     NaN
6         NaN   330.0

In [24]:
#To find the most popular name or the baby name with the highest birth rate
#sort the dataframe and select the top row
#Use the max() attribute to find the maximum value
#Method 1 :

import pandas as pd
df1 = pd.read_csv('E:\\Python\\births1882.csv')
Sorted = df1.sort_values(['Births'],ascending = True)
print(Sorted)

        Names  Births
2    Bulbasor    77.0
1  Charmender   155.0
6         NaN   330.0
3    Squartel   578.0
0     Pikachu   968.0
4       Piege   973.0
5        Alex     NaN

In [26]:
print(Sorted.head(2)) #first two elements

        Names  Births
2    Bulbasor    77.0
1  Charmender   155.0

In [27]:
print(Sorted.tail(2)) #last two elements

   Names  Births
4  Piege   973.0
5   Alex     NaN

In [28]:
#Method 2
df1['Births'].max()

973.0

In [29]:
Sorted = df1.sort_values(['Names'],ascending = True)
print(Sorted)

        Names  Births
5        Alex     NaN
2    Bulbasor    77.0
1  Charmender   155.0
4       Piege   973.0
0     Pikachu   968.0
3    Squartel   578.0
6         NaN   330.0

In [30]:
#find no of birth for Name Pikachu
df1['Births'][df1['Names'] == 'Pikachu']

0    968.0
Name: Births, dtype: float64

In [31]:
#What is the average no. of Births
df1['Births'].mean() #Calculate

513.5

In [39]:
#Extract rows with null values
print(df1)
#check if any Nan values in data frame
print(df1.isnull().values.any())

        Names          Births
0     Pikachu             968
1  Charmender             155
2    Bulbasor              77
3    Squartel             578
4       Piege             973
5        Alex             NaN
6         NaN             246
True

In [44]:
#Check Nan in column
print(df1)
nan_rows = df1[df1['Names'].isnull()]
nan_rows

        Names          Births
0     Pikachu             968
1  Charmender             155
2    Bulbasor              77
3    Squartel             578
4       Piege             973
5        Alex             NaN
6         NaN             246

  Names Births
6   NaN    246

In [32]:
df1['Births'].fillna(444,inplace = True)
print(df1)

        Names  Births
0     Pikachu   968.0
1  Charmender   155.0
2    Bulbasor    77.0
3    Squartel   578.0
4       Piege   973.0
5        Alex   444.0
6         NaN   330.0

In [48]:
df1['Names'].fillna('Rahul',inplace = True)
print(df1)

        Names          Births
0     Pikachu             968
1  Charmender             155
2    Bulbasor              77
3    Squartel             578
4       Piege             973
5        Alex             NaN
6       Rahul             246

In [51]:
#method ffill for forward fill
#limit will restrict the replacemet

#df1['Names'].fillna

In [19]:
df1 = pd.read_csv('E:\\Python\\nyc_weather.csv')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 11 columns):
EST                     31 non-null object
Temperature             31 non-null int64
DewPoint                31 non-null int64
Humidity                31 non-null int64
Sea Level PressureIn    31 non-null float64
VisibilityMiles         31 non-null int64
WindSpeedMPH            28 non-null float64
PrecipitationIn         31 non-null object
CloudCover              31 non-null int64
Events                  9 non-null object
WindDirDegrees          31 non-null int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.8+ KB

In [83]:
#Understand data set

import pandas as pd
df = pd.read_csv('E:\\python\\nyc_weather.csv')
print(df.shape) #Display no. of rows-shapes [0] & column[1]

(31, 11)

In [84]:
print(df.dtypes)

EST                      object
Temperature               int64
DewPoint                  int64
Humidity                  int64
Sea Level PressureIn    float64
VisibilityMiles           int64
WindSpeedMPH            float64
PrecipitationIn          object
CloudCover                int64
Events                   object
WindDirDegrees            int64
dtype: object

In [85]:
df.head(5)
df.tail(5)
print(list(df)) #Display column names

['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn', 'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover', 'Events', 'WindDirDegrees']

In [86]:
print(df.columns.tolist)

<bound method IndexOpsMixin.tolist of Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')>

In [100]:
df.count()

EST                     31
Temperature             31
DewPoint                31
Humidity                31
Sea Level PressureIn    31
VisibilityMiles         31
WindSpeedMPH            28
PrecipitationIn         31
CloudCover              31
Events                   9
WindDirDegrees          31
dtype: int64

In [101]:
df.describe() #statistics of all the columns

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [99]:
df['Humidity'].describe() #Describe only one columne

count    31.000000
mean     51.677419
std      11.634395
min      33.000000
25%      44.500000
50%      50.000000
75%      55.000000
max      78.000000
Name: Humidity, dtype: float64

In [88]:
df.info

<bound method DataFrame.info of           EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
0    1/1/2016           38        23        52                 30.03
1    1/2/2016           36        18        46                 30.02
2    1/3/2016           40        21        47                 29.86
3    1/4/2016           25         9        44                 30.05
4    1/5/2016           20        -3        41                 30.57
5    1/6/2016           33         4        35                 30.50
6    1/7/2016           39        11        33                 30.28
7    1/8/2016           39        29        64                 30.20
8    1/9/2016           44        38        77                 30.16
9   1/10/2016           50        46        71                 29.59
10  1/11/2016           33         8        37                 29.92
11  1/12/2016           35        15        53                 29.85
12  1/13/2016           26         4        42                 29.94
13  1/14/2016           30        12        47                 29.95
14  1/15/2016           43        31        62                 29.82
15  1/16/2016           47        37        70                 29.52
16  1/17/2016           36        23        66                 29.78
17  1/18/2016           25         6        53                 29.83
18  1/19/2016           22         3        42                 30.03
19  1/20/2016           32        15        49                 30.13
20  1/21/2016           31        11        45                 30.15
21  1/22/2016           26         6        41                 30.21
22  1/23/2016           26        21        78                 29.77
23  1/24/2016           28        11        53                 29.92
24  1/25/2016           34        18        54                 30.25
25  1/26/2016           43        29        56                 30.03
26  1/27/2016           41        22        45                 30.03
27  1/28/2016           37        20        51                 29.90
28  1/29/2016           36        21        50                 29.58
29  1/30/2016           34        16        46                 30.01
30  1/31/2016           46        28        52                 29.90

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover    Events  \
0                10           8.0               0           5       NaN
1                10           7.0               0           3       NaN
2                10           8.0               0           1       NaN
3                10           9.0               0           3       NaN
4                10           5.0               0           0       NaN
5                10           4.0               0           0       NaN
6                10           2.0               0           3       NaN
7                10           4.0               0           8       NaN
8                 9           8.0               T           8      Rain
9                 4           NaN             1.8           7      Rain
10               10           NaN               0           1       NaN
11               10           6.0               T           4       NaN
12               10          10.0               0           0       NaN
13               10           5.0               T           7       NaN
14                9           5.0               T           2       NaN
15                8           7.0            0.24           7      Rain
16                8           6.0            0.05           6  Fog-Snow
17                9          12.0               T           2      Snow
18               10          11.0               0           1       NaN
19               10           6.0               0           2       NaN
20               10           6.0               0           1       NaN
21                9           NaN            0.01           3      Snow
22                1          16.0            2.31           8  Fog-Snow
23                8           6.0               T           3      Snow
24               10           3.0               0           2       NaN
25               10           7.0               0           2       NaN
26               10           7.0               T           3      Rain
27               10           5.0               0           1       NaN
28               10           8.0               0           4       NaN
29               10           7.0               0           0       NaN
30               10           5.0               0           0       NaN

    WindDirDegrees
0              281
1              275
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340
16             345
17             293
18             293
19             302
20             312
21              34
22              42
23             327
24             286
25             244
26             311
27             234
28             298
29             257
30             241  >

In [97]:
df['Events'] = df.Events.astype('category') #change  event to categories
df['Events'].describe()
df.info

<bound method DataFrame.info of           EST  Temperature  DewPoint  Humidity  Sea Level PressureIn  \
0    1/1/2016           38        23        52                 30.03
1    1/2/2016           36        18        46                 30.02
2    1/3/2016           40        21        47                 29.86
3    1/4/2016           25         9        44                 30.05
4    1/5/2016           20        -3        41                 30.57
5    1/6/2016           33         4        35                 30.50
6    1/7/2016           39        11        33                 30.28
7    1/8/2016           39        29        64                 30.20
8    1/9/2016           44        38        77                 30.16
9   1/10/2016           50        46        71                 29.59
10  1/11/2016           33         8        37                 29.92
11  1/12/2016           35        15        53                 29.85
12  1/13/2016           26         4        42                 29.94
13  1/14/2016           30        12        47                 29.95
14  1/15/2016           43        31        62                 29.82
15  1/16/2016           47        37        70                 29.52
16  1/17/2016           36        23        66                 29.78
17  1/18/2016           25         6        53                 29.83
18  1/19/2016           22         3        42                 30.03
19  1/20/2016           32        15        49                 30.13
20  1/21/2016           31        11        45                 30.15
21  1/22/2016           26         6        41                 30.21
22  1/23/2016           26        21        78                 29.77
23  1/24/2016           28        11        53                 29.92
24  1/25/2016           34        18        54                 30.25
25  1/26/2016           43        29        56                 30.03
26  1/27/2016           41        22        45                 30.03
27  1/28/2016           37        20        51                 29.90
28  1/29/2016           36        21        50                 29.58
29  1/30/2016           34        16        46                 30.01
30  1/31/2016           46        28        52                 29.90

    VisibilityMiles  WindSpeedMPH PrecipitationIn  CloudCover    Events  \
0                10           8.0               0           5       NaN
1                10           7.0               0           3       NaN
2                10           8.0               0           1       NaN
3                10           9.0               0           3       NaN
4                10           5.0               0           0       NaN
5                10           4.0               0           0       NaN
6                10           2.0               0           3       NaN
7                10           4.0               0           8       NaN
8                 9           8.0               T           8      Rain
9                 4           NaN             1.8           7      Rain
10               10           NaN               0           1       NaN
11               10           6.0               T           4       NaN
12               10          10.0               0           0       NaN
13               10           5.0               T           7       NaN
14                9           5.0               T           2       NaN
15                8           7.0            0.24           7      Rain
16                8           6.0            0.05           6  Fog-Snow
17                9          12.0               T           2      Snow
18               10          11.0               0           1       NaN
19               10           6.0               0           2       NaN
20               10           6.0               0           1       NaN
21                9           NaN            0.01           3      Snow
22                1          16.0            2.31           8  Fog-Snow
23                8           6.0               T           3      Snow
24               10           3.0               0           2       NaN
25               10           7.0               0           2       NaN
26               10           7.0               T           3      Rain
27               10           5.0               0           1       NaN
28               10           8.0               0           4       NaN
29               10           7.0               0           0       NaN
30               10           5.0               0           0       NaN

    WindDirDegrees
0              281
1              275
2              277
3              345
4              333
5              259
6              293
7               79
8               76
9              109
10             289
11             235
12             284
13             266
14             101
15             340
16             345
17             293
18             293
19             302
20             312
21              34
22              42
23             327
24             286
25             244
26             311
27             234
28             298
29             257
30             241  >

In [102]:
print(df.dtypes)

EST                       object
Temperature                int64
DewPoint                   int64
Humidity                   int64
Sea Level PressureIn     float64
VisibilityMiles            int64
WindSpeedMPH             float64
PrecipitationIn           object
CloudCover                 int64
Events                  category
WindDirDegrees             int64
dtype: object

In [73]:
Data=(1,2,3,4)
df=pd.DataFrame(Data)
print(df)

   0
0  1
1  2
2  3
3  4

### 9/12/2019

In [3]:
import pandas as pd
df = pd.read_csv('E:\\python\\nyc_weather.csv')
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [4]:
df.tail()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [5]:
df.head(3)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277

In [9]:
#select rows based on index
#select rows 0,1,2(rows 3 is not selected)
df[0:3]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277

In [11]:
#select the first five rows (rows 0,1,2,3,4)
df[:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [18]:
df.iloc[0:3,3:6]

   Humidity  Sea Level PressureIn  VisibilityMiles
0        52                 30.03               10
1        46                 30.02               10
2        47                 29.86               10

In [19]:
df.loc[[0,3],:]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345

In [20]:
#loc gets rows (or columns) with particular labels from the index
#iloc gets rows (or columns) at particular in the index(so it only to)
df.iloc[2:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [21]:
df.iloc[2:5,1:5]

   Temperature  DewPoint  Humidity  Sea Level PressureIn
2           40        21        47                 29.86
3           25         9        44                 30.05
4           20        -3        41                 30.57

In [23]:
df.iloc[1:5]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [24]:
df.iloc[:,2]

0     23
1     18
2     21
3      9
4     -3
5      4
6     11
7     29
8     38
9     46
10     8
11    15
12     4
13    12
14    31
15    37
16    23
17     6
18     3
19    15
20    11
21     6
22    21
23    11
24    18
25    29
26    22
27    20
28    21
29    16
30    28
Name: DewPoint, dtype: int64

In [11]:
#data bining

import numpy as np
import pandas as pd

ser = pd.Series(np.random.random(20))
print(ser)

0     0.394062
1     0.979081
2     0.905751
3     0.453667
4     0.796692
5     0.880076
6     0.292721
7     0.790940
8     0.877940
9     0.982095
10    0.918110
11    0.516029
12    0.287422
13    0.361251
14    0.309203
15    0.142733
16    0.329025
17    0.515628
18    0.115149
19    0.995793
dtype: float64

In [12]:
print(ser.head())

0    0.394062
1    0.979081
2    0.905751
3    0.453667
4    0.796692
dtype: float64

In [39]:
#solution
ser1 = pd.qcut(ser, q=[0,.10,.20,.3,.4,.5,.6,.7,.8,.9,1], labels =['1st','2nd','3rd','4th','5th','6th','7th','8th','9th','10th'])
ser1

0      3rd
1      7th
2      3rd
3      5th
4      6th
5      2nd
6      1st
7      5th
8      1st
9      8th
10     9th
11     4th
12     8th
13    10th
14     2nd
15     9th
16     6th
17    10th
18     4th
19     7th
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

In [34]:
df100 = pd.DataFrame({'col': ser, 'col2':ser1})
df100

         col  col2
0   0.230731   3rd
1   0.700732   7th
2   0.392023   3rd
3   0.436964   5th
4   0.536429   6th
5   0.066931   2nd
6   0.038483   1st
7   0.432392   5th
8   0.011613   1st
9   0.748939   8th
10  0.847035   9th
11  0.415535   4th
12  0.749867   8th
13  0.932018  10th
14  0.199008   2nd
15  0.780019   9th
16  0.610848   6th
17  0.852673  10th
18  0.396035   4th
19  0.702154   7th

In [46]:
df100.head()

        col col2
0  0.230731  3rd
1  0.700732  7th
2  0.392023  3rd
3  0.436964  5th
4  0.536429  6th

In [51]:
df100.dtypes

col      float64
col2    category
dtype: object

In [52]:
df100['col2'].value_counts()

10th    2
9th     2
8th     2
7th     2
6th     2
5th     2
4th     2
3rd     2
2nd     2
1st     2
Name: col2, dtype: int64

In [54]:
df = pd.DataFrame({'Animal':['Falcon','Falcon','Parrot','Parrot'],'Max Speed' :[380.,370.,24.,26.]})
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [55]:
print(df['Animal'].value_counts()) #count of animals

Parrot    2
Falcon    2
Name: Animal, dtype: int64

In [58]:
print(df.groupby(['Animal']).sum())

        Max Speed
Animal
Falcon      750.0
Parrot       50.0

In [59]:
print(df.groupby(['Animal']).mean())

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [62]:
df_gr = df.groupby('Animal')

In [63]:
print(df_gr)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000025529197F88>

In [66]:
print(df_gr['Animal','Max Speed'].max())

        Animal  Max Speed
Animal
Falcon  Falcon      380.0
Parrot  Parrot       26.0

In [67]:
print(df_gr['Animal','Max Speed'].mean())

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [70]:
print(df_gr['Animal'].value_counts())

Animal  Animal
Falcon  Falcon    2
Parrot  Parrot    2
Name: Animal, dtype: int64